[
    { 
      "title": "Backyard Retreat",
      "githubLink": "https://github.com/cptaylor38/byrsample",
      "deployedLink": "https://thebackyardretreat.netlify.app/",
      "body": "A quick Gatsby redesign of the website of a local home and garden store. The business primarmily uses Facebook but I noticed the site was a little flat. Original site here: http://thebackyardretreat.com/. Wanted to stay true to the mom and pop shop theme with a little flair and provide more organization to some of the site features, like the gardening tips and the history of the store and its owners.",
      "image": "backyard-min.png",
      "tech": "Gatsby, React Hooks, Javascript, HTML, CSS",
      "id": 1
    },
    {
      "title": "Designer Delve",
      "githubLink": "https://github.com/cptaylor38/DesignerDelve",
      "deployedLink": "https://designer-delve.herokuapp.com/",
      "body": "An app designed for freelance artists to submit their artwork and be found. When they submit their artwork they have the option of including their Facebook and LinkedIn as means of contact. Users can also search a variety of mediums and by state. My role consisted of database/schema, wiring front-end, handlebars integration, and some styling touch-ups to give it more responsiveness and a cohesive appearance. This project was built with handlebars, uses a Cloudinary widget for image uploads, and MySQL for the database.",
      "image": "ddHome-min.png",
      "tech": "Handlebars.js, MySQL and Sequelize, Node, HTML, CSS, Javascript",
      "id": 2
    },
    {
      "title": "Scraps",
      "githubLink": "https://github.com/cptaylor38/scraps",
      "deployedLink": "https://scrapsproject.herokuapp.com/",
      "body": "A fun-themed site, admittedly lacking in responsiveness and built last minute. It was my final group project during my coding bootcamp and my first experience with React. We experienced a number of setbacks during our concept phase of our final project and threw this together. Preview songs with the spotify api, record notes or write down songs you discover with MongoDb, and enjoy a blast from the past with this retro themed amalgamation. My role involved React integration, API development and consumption, fixing Firebase auth persistence, and user experience. It may not be the prettiest, or most intuitive, but it was a lot of fun to build.",
      "image": "scrapsPreview-min.png",
      "tech": "React/React Hooks, GSAP, Firebase for authentication, MongoDB and Mongoose, Node, HTML, CSS, Javascript",
      "id": 3
    },
    {
      "title": "Penny",
      "githubLink": "https://github.com/cptaylor38/Penny",
      "deployedLink": "https://penny-checkbook.herokuapp.com/",
      "body": "A MERN stack expense/budget managing app. Uses a Gmail Passport strategy for login and authentication, gsap for some minor animations, and Chart.js for some analytics visuals. Add your salary and expenses, monthly or one time charges, to the cateogry that helps you stay more organized. The overview provides pie charts representing your total expenses for each monthly and non-monthly and gives you a rundown of your total expenses with regards to your monthly income.",
      "image": "pennyExpense-min.png",
      "tech": "React/React Hooks, Redux, GSAP, Passport for authentication, MongoDB and Mongoose, Node, HTML, CSS, Javascript, Chart.js",
      "id": 4
    },
    {
      "title": "Clicky Endgame",
      "githubLink": "https://github.com/cptaylor38/Clicky-Endgame",
      "deployedLink": "https://cptaylor38.github.io/Clicky-Endgame/",
      "body": "An Avenger's Endgame themed memory game made with React. Win by clicking each Avenger no more than once.",
      "image": "clickyEndgame-min.png",
      "tech": "React, HTML, CSS, Javascript",
      "id": 5
    },
    {
      "title": "Liri",
      "githubLink": "https://github.com/cptaylor38/LIRI",
      "deployedLink": "",
      "body": "A command line node app that lets users search for songs on the Spotify api, movies on the OMDB api, and conerts using the BandsInTown api.",
      "image": "liri-min.png",
      "tech": "Node, Javascript",
      "id": 6
    },
    {
      "title": "Bamazon",
      "githubLink": "https://github.com/cptaylor38/bamazon",
      "deployedLink": "",
      "body": "A command line node app that uses MySQL and implements a basic retail inventory management tool similar to AS400.",
      "image" : "bamazon-min.png",
      "tech": "Node, MySQL, Javascript",
      "id": 7
    },
    {
      "title": "Wordstock",
      "githubLink": "https://github.com/cptaylor38/Wordstock",
      "deployedLink": "https://wordstock-app.herokuapp.com/",
      "body": "Dictionary/Translator app using MyMemory and Words api's. Use the dictionary or translate a word or phrase from English up to a selection of other languages. A simple jquery/html/css site with a theme of connection and diversity.",
      "image": "wordstockTranslate-min.png",
      "tech": "HTML, CSS, Javascript",
      "id": 8
    }
  ]
  